export default {
    isfjDetail: "ISFJ型热情，亲切周到，忠诚体贴，他们是坚守传统又值得依赖的可靠伙伴。\n" +
        "\n" +
        "ISFJ们往往偏爱常规的、熟悉的、可预测的事物，他们富有责任心，是规范和传统的接纳者，并在日常生活中塑造出一套固定的思考和行为模式，且能始终如一地坚持下去。同时，ISFJ们喜欢不断地回顾过去和那些宝贵的传统，并用它们来指导具体的应用，在做事时会思考如何才能符合逻辑或者规范。\n" +
        "\n" +
        "此外，在社会交往中，他们重视安全感和友善的感觉，试图营造良好的情感氛围，关注他人的需求并照顾他们的感受，从而温柔又共情地对待人们。\n" +
        "\n" +
        "虽然ISFJ们对于新事物的接纳程度偏低，面对矛盾和冲突时常选择压抑自己的情感和需求，但正是他们这种温暖而可靠的特质，默默地守护着历史、传统、秩序，并用心维护着人际关系的和谐。\n" +
        "\n" +
        "ISFJ型总倾向于背后出力。敏感、端庄、一丝不苟、顺从、义务感强。\n" +
        "\n" +
        "他们的活力源自于内在（I型）而用五感捕捉现实（S型），表现活力时主要为了他人（F型）而在适合的时机（J型）使用。因此，他们尽己所能，在令他人开心这件事上寻找人生的意义。\n" +
        "\n" +
        "对于ISFJ型合适的比喻是值得依靠的防波堤，总是默默地等待其出场机会。因为是J型，即使被干涉时会抱怨两句，最终常常还是由于义务感强烈而做好应该做的事情。ISFJ型会被伙伴和友人批评为太过于滥好人而容易受利用。不过，这些伙伴和友人也经常一边这么说，一边同样地依赖于这种滥好人行为而内心感到愧疚。实际上，ISFJ型由于认真考虑约定和义务，常常会被他人利用这些特质。\n" +
        "\n" +
        "ISFJ型的男性特质和女性特质上，男性相对复杂，而女性十分单纯。SFJ型从特征而言，几乎完全符合形容刻板印象中形容“女性特质”的语言：温柔、保守、体贴、沉着、依赖感强、照顾人、贞洁、顺从、爱漂亮、整洁。\n" +
        "\n" +
        "事实上，ISFJ的女性虽然嘴上不说，但心中会对其他类型的女性“不像女性应该有的样子” 的行动不满和批判。因为一直按照传统女性印象而行动，上了年纪后他们有时也会故意采取反弹的“不像女性”的行为方式，不但让周围的人感到惊讶，甚至会因为太不符合她原本的标准而被人所斥责。\n" +
        "\n" +
        "若ISFJ型是最符合传统女性形象的类型，ISFJ型男性的温柔、关心、老实和顺从等性格则完全与传统男性形象相反。结果上，为了更有“男子气概”，ISFJ型男性可能会不得不选择强行抑制自己本来的行为方式。在这种情况下，他们常常会必要以上地做一些“男性化举动”，如过度饮酒或吸烟，或为了展现自己的男性气质而变得具有强烈的斗争性。",
    esfjDetail: "ESFJ型，妥帖周到、乐于助人，用真诚善良的热情带来安定、温暖与和谐。\n" +
        "\n" +
        "在ESFJ的眼中，和谐的社会关系，和一切按部就班的稳定，是生活中最重要的事，他们也愿意为此主动奉献，把生活的每个细节都打理的尽善尽美。\n" +
        "\n" +
        "由于是高度情感主导且情绪外露的性格，ESFJ有时会被认为有些唠叨、逻辑不足，但他们通常不会因此减少自己的付出，因为他们相信这正是他人所需要的东西。\n" +
        "\n" +
        "ESFJ型是和蔼的慈母，温和的暖男，集体中的调和剂，团队和谐的促进人。\n" +
        "\n" +
        "ESFJ型非常擅长待人接物。\n" +
        "\n" +
        "他们活用自己的F型特点，什么状况下，都在追求协调和善意运作的同时，平稳却毅然地控制着场面。这种类型经常被认为是母性的象征。他们温柔、擅长照顾他人，又表现出外向的特征（E型），超过必要地为他人服务。\n" +
        "\n" +
        "ESFJ型的男性，比起“就交给我吧”这样的话，更重视他人的需要。这就导致想要在外表展现男性气质的心情和压制这种想法的心情间产生冲突。明明SJ型的自我相当有男子气概、客观冷静还有点强硬，EF型的一面却充当温和又爱照顾人的心理角色。\n" +
        "\n" +
        "若把ESFJ型的男性比作虎落平阳的话，ESFJ型的女性则可以说是女性传统形象的化身。她们打扮得体、说话得体、行为举止得体。对于ESFJ型而言，家庭就是宇宙的中心。家庭是休憩的场合，他们以家庭为堡垒，守护家族远离外界的严酷。在家中他们总会把一切打理得整整齐齐。若明明床铺还没整理好，厨房还是脏的，没人能阻止她把这些打点好的强烈义务心。\n" +
        "\n" +
        "他们不把杂事做完绝不休息，并且因为是J型，读书或者和朋友一起共度时光这种放松的事情也要提前预定好。他们看重家庭生活，并且什么事都要事先预定好，不“妥当”的话就不会满意。这种对于“妥当”的追求有很多，例如在聚会上，从服装、装饰品一直到举止，都在其列。\n" +
        "\n" +
        "ESFJ型喜欢给家人挨个布置职责，并期待成员们按照预定完成目标。若没能达到他们的期待，他们会感到伤心或者生气。",
    istjDetail: "ISTJ型是最可靠、踏实的一群人，他们用沉勇坚定的态度和脚踏实地的努力面对生活、守护秩序，为我们带来稳定和安全。\n" +
        "\n" +
        "ISTJ型相信传统、经验和规则的必要性，并将守护它们的责任镌刻心间，矢志不渝。尤其在做那种细节繁多的重复性工作时，ISTJ型总能精确到每一个细节，将流程执行得滴水不漏，同时发现那些不合规则、影响效率的环节，因此ISTJ又被称为“审计师”性格。\n" +
        "\n" +
        "他们沉默、传统而理性的性格就像家中的严父，虽说可能有时显得不够善解人意，但那份深沉如山的责任心却始终能带给人安全感和长足的安宁。\n" +
        "\n" +
        "这是一种从责任感上采取“做该做的事”行动的类型。\n" +
        "\n" +
        "ISTJ型虽然内向，但是在人际关系中，与人交往、说话等都会发自责任感地掌握每个场合应做的合适的行动。他们于不同的立场能以看似善于社交的方式行动，因此偶尔会被误解为外向的人。\n" +
        "\n" +
        "但是，不该因此对他们有所误解。这种类型的内向的人会根据状况，在不改变原本的内向性格的前提下披上外向型的外衣。可以预见地，与拥有I型、T型和J型性格的INTJ一样，他们在学校也好，职场也好，都是比别人更厉害的优等生，多为同学和项目的负责人或是地域社会的领导——以上的每个听起来都不像是I型人的身份，然而他们却常能做到这样。\n" +
        "\n" +
        "“做应尽之事”，他们只是不断尽到责任。\n" +
        "\n" +
        "当今社会由于女性权益保障不够健全，T型的女性因不和传统相符，有时陷入困境，尤其是ISTJ型的女性。这个类型停不下来的强责任感的性格虽然令人称赞，却与刻板印象中的“女性形象”完全相反。况且，由于其本身便是捍卫传统的类型，在维持传统女性的职责和客观的计划性（TJ型）性格的平衡中，往往使他们内心产生纠结。\n" +
        "\n" +
        "与之相反，拥有ISTJ型性格的男性则“完全吻合”传统的男性特质，因此常被认为是“看了就觉得是男性的类型”，所以不太受女性的喜爱。\n" +
        "\n" +
        "ISTJ型善于掌握家务要领，将家里整理地很好。不管怎样，早饭是八点，午餐是十二点，晚饭是六点，这种事情总想要决定好。他们常从休假开始，就会因为十分重视将和家人一起度过的各种节日和活动而毫不吝惜经费地准备到最好。若和其他类型的家人不能步调一致，会感到在意或沮丧。他们在其家庭和外表上，常表现出保护传统的做事一本正经的倾向。\n" +
        "\n" +
        "从外面看ISTJ型的家，大概就明白了。院子被涂着令人平静的颜色，自行车和玩具都没有散乱地放着，虽然保守，却放着不少有意思的收集品。\n" +
        "\n" +
        "一切都在其该在的地方。",
    estjDetail: "ESTJ型，强健坚毅、雷厉风行，严于律人更严于律己，是一群富有高度领导力的人。\n" +
        "\n" +
        "无论是生活还是工作中，ESTJ型都目标明确、行事果断，只要是认准的事情，他们都会严格地安排流程和规则，按部就班地领导着他人将事情做完、做好。在这一过程中，ESTJ型“事实逻辑大师”的能力展现无遗，他们最擅长列举证据、分析数据和考察现状，客观冷静地说服他人跟从自己的方法论和目标。\n" +
        "\n" +
        "在解决问题的方式方面，他们也相当灵活，通过多种多样的手段高效达成目标，是他们一直以来的追求。不过在他们看来，任何的创新都要有实际的证据作为支持，纯粹的直觉就宛如无源之水无本之木，而且那些打破传统价值的事物也容易带来不安和低效，因此ESTJ有时也会被认为三观古板。\n" +
        "\n" +
        "然而，这种万事基于事实和证据的思考逻辑为ESTJ提供了极高的下限，让他们能够立足于社会的中坚，创立坚实可靠的事业。\n" +
        "\n" +
        "ESTJ型对一切接受现状（S型），客观地看待世界（T型）。并且，因为他们是EJ型，所以会把自己的判断施加于人。就如同鱼儿天生就会游泳一样，ESTJ型天生就擅长管理。（虽然他们未必能得到领导地位）\n" +
        "\n" +
        "ESTJ型人对于什么事都始终如一、有组织地行动、擅长与人交往、学习也不错、总能做出合适的判断，因此被人认为是可以信赖的实务家和擅长工作的能手。他们在任何组织都不难上升到顶端。其持有的管理能力不限于职场，在家庭之中、邻里之间，乃至于各式各样的团队活动都能充分发挥。\n" +
        "\n" +
        "用传统的眼光来看，ESTJ型比较偏向男性特质。外向而富有决断力，又是实干家和自信家，因而倾向于成为家庭的顶梁柱和保护者。这些一般来说是男性的职责所在。而ESTJ型的女性，有些人可能会想自己更有“女性气质”，但天生的性格如“强硬、意志坚决、处事笃定、有决断力”，却会和传统印象的女性特质如“柔软、心地温柔、被动接受、有顺应性”产生冲突，从而使自己感到矛盾。\n" +
        "\n" +
        "ESTJ型的生活方式中，家庭也是管理的一部分。勤勉、整齐地确立计划、论功行赏，这便是ESTJ型人生活的商标了。即使是在娱乐、闲暇和自由安排的时间，他们也喜欢制定计划，小题大做地根据多么好好地遵守了平常的决定而褒奖自己或他人。",
    isfpDetail: "ISFP型是细腻敏感、心灵手巧的艺术家，是艺术创作者(SP型)中的艺术创作者。\n" +
        "\n" +
        "他们安静而自我，会用自己独特而精细的审美观，为自己的生活打造一个祥和美好的小窝，安逸闲适地享受其中的百般情感。\n" +
        "\n" +
        "正因如此，他们不喜在社交上花太多时间，同时尽量回避辩论和冲突，因此常常被认为是缺乏存在感的一群人。不过，他们会努力捍卫自己富有美感的生活方式，在这方面会非常坚定和不容干涉，有时甚至会有颇为情绪化的反应从而让人感到意外。\n" +
        "\n" +
        "然而，正是这种对于“美丽地栖居”的信念，使得ISFP类型常常能够在艺术、文学等领域，展现出别具一格的成就——虽然对他们来说，成就总是随缘，小确幸地生活才是最开心的事情。\n" +
        "\n" +
        "他们虽然经常只是旁观，却有着爱人之心并易于感受。ISFP型有着享受人生的心境。\n" +
        "\n" +
        "ISFP型比起任何类型都更对自身和周围的世界饱含兴趣。他们很少有指导他人或支配他人的情感。无论是植物还是动物亦或是人类，ISFP都很想看到他们协调地活着的样子。他们不想对他人强加干涉，而是想要从侧面鼓励，发挥对方的能力。\n" +
        "\n" +
        "他们认为周围的每个人各有生活方式，经常由于过于尊重这一点而对其他人“对他人施加限制和条条框框”的做法感到十分不解。由于性格上不强加于人，乍看似乎缺乏指导力，所以经常被他人无视或强加。某种意义上，他们是十六种类型中最不显眼的存在。\n" +
        "\n" +
        "F型（温热、照料）和P型（心胸宽广、柔软性）是传统温和的女性的特征，I型（认真思考，缄默）和S型（实际的，基于根据）是传统现实的男性的特征。这四个性格相结合，便成为不怎么拥有领导力或赋予影响力的类型。在这世上的种种关系中，他们几乎不倾向于改变或支配，而是以其原本的样貌接受。因此，ISFP型的男性或女性，大多都不会给他人留下很强的印象，也很少与人产生竞争冲突。\n" +
        "\n" +
        "ISFP型的男性常因为在各种各样的职责发挥自己的作用而得到尊重。对于希望被另一半照顾的女性来说，这个类型的男性是非常受欢迎的。\n" +
        "\n" +
        "ISFP的男性和女性都会经常对自己产生过小的评价。因此，当被恭维时，常常自谦“并不是有意的”或“只是偶然啦”之类的话。",
    esfpDetail: "ESFP型，外放随性，积极活跃，着眼当下说做就做的他们是可爱的乐天派。\n" +
        "\n" +
        "ESFP们活在当下，追求直接的感官刺激，“嗨起来”的感觉是他们动力的源泉。在体育场、舞台和社交场合，他们总能点燃全场，带来无尽的欢乐和激情。做事时，他们也会被当下的感觉和心情驱使，不愿多想，说做就做。\n" +
        "\n" +
        "然而，不喜欢长时间做同一件事情的心情让他们难以做到坚持不懈。在行事风格上，他们偏爱自由和主动，活泼通融，擅长随机应变，随遇而安又注重实际。\n" +
        "\n" +
        "虽然ESFP们有时被认为是冲动短视、囿于表面、在谋划上有所欠缺，但正是他们活力开放和珍惜当下的生活态度，以及真诚地为人尽力的心态，都让他们在面对人群时显得率直可爱又生动有趣。\n" +
        "\n" +
        "16种类型中，ESFP型最认真地活在当下。\n" +
        "\n" +
        "他们常以“现在做，赊账以后还”为座右铭。因为是ES型，属于“未来的富足不如现在的温饱”主义的典型。ISFP型中包含I型（内倾），行动前会稍作考虑；但ESFP型是E型（外倾），会立刻采取行动，很快做出肉眼可见的结果。因为极快地投入行动，常被贴上“轻狂”、“过分活跃”、“自我为中心”等负面标签，明明实际上并非如此，却常被人认为如此。\n" +
        "\n" +
        "ESFP型人可以使周围的人心情高涨而积极，但配合ESFP型人的节奏会让人累的喘不过来气。\n" +
        "\n" +
        "ESFP型的男性和女性都常常叹息“谁都不真心接受自己”。这种类型的特征而言，其“擅长照顾孩子”、“为人尽力而开心”，“不爱争斗”的性格，比起刻板印象中的男性形象来说更接近女性形象。所以当ESFP型的男性展示这样的倾向时，会被传统主义者们怀疑是否有男子气概。ESFP型人因为会突然用很快的语速说话，一开始常被认为很粗野，实际上，他们察觉理解他人心情并照顾人的类型。\n" +
        "\n" +
        "ESFP型就算放松时，若不做点什么，还是会感觉不能安心。所谓ESP型，便是那种一个人呆着的时候，考虑时间太长就会粗枝大节地得出一个不好的结论的类型。这也是为何对他们而言“在做些什么”总比“什么也不做”要好。其他类型完全不感到放松的“到处活动”，对于ESFP来说不仅是一个愉快的散心，还是“一直想去”把各种事情都做做看的机会。\n" +
        "\n" +
        "这样的场景往往非常具有ESFP的特色——周末为了悠闲地度过而前往海滩，结果却变成在周边四处寻找有趣的店铺，或是为了给朋友当礼物而采集贝壳，总之，最后投身于各种各样的行动之中。",
    istpDetail: "ISTP型不愿受到约束，擅长以五感理解世界。\n" +
        "\n" +
        "他们有优秀的观察力，在生活和工作中敏锐地捕捉一切信息，在内心的思考中完善对身边事物的把握。即使不依赖说明书或课程等已有经验，ISTP型仍能迅速靠动手实践而自成体系地理解一项工作的精髓。\n" +
        "\n" +
        "他们极力避免将时间运用在无用的地方，但对于有意义的事物，便比谁都能快速地解构和掌握。\n" +
        "\n" +
        "ISTP型擅长全身心投入体育或工艺，并把常人看起来精密复杂的事情做到极致，但有时显得对他人漠不关心或对社会冷眼旁观。这是因为他们虽然内向却善于体悟世间哲理，因而是天生的讽刺大师。\n" +
        "\n" +
        "谨慎谦让、无拘无束，人际关系中谨言慎行，然而什么东西都想尝试做做看。\n" +
        "\n" +
        "ISTP型是注重内心世界的类型（I型），同时又有着客观地做决断的倾向。他们常根据对话将会怎样进行、别人将会怎么做，察言观色地选择合适的时机来打出自己的底牌。因为他们的思考方式比较具体（S型），且他们总能够捕捉自己周围一切相关的信息（P型），一旦做起事来便从原本看似畏首畏尾的样子变成具有行动力和主动性的角色。\n" +
        "\n" +
        "他们会突然说出出人意料的冷幽默，或者一反常态地采取“就交给我吧”的态度，甚至突然修好坏掉的东西，这些做法常会让其他人感到奇妙甚至困惑。\n" +
        "\n" +
        "ISTP型有一双巧手，会在快速完成一件肉眼可见的成品时感到满足。他们拥有优秀的观察力，如果有喜欢的东西，他们不认为需要阅读说明书、按照上面的流程做事，而会马上开工动手。因此，他们喜欢快速投入工作，当结果顺遂时，会有靠自己成功的满足感。即使在工作的关键部分，不得不读说明书的时候，他们也只会读直接关联的几个部分。\n" +
        "\n" +
        "ISTP型极想要避免的一件事情，就是把时间和劳力花在无用的地方。当他们认为被分配的工作没意思、无聊、不实际的时候，比起这些工作，他们会优先于做自己所关心或喜欢的事情。他们时长太过于热衷于自己想做的事情，便将其他应做的事（虽然不代表他们无视或忘记了这件事）给丢在此要位置。\n" +
        "\n" +
        "如果他们感兴趣的话，会把工作做得非常严密和精确，能让他人惊讶地羡慕他们的能力。如果是为了工作，即使是置身于危险中也不能让他们打退堂鼓。\n" +
        "\n" +
        "ISTP型的男性能够在传统的男性活动（如一对一的体育项目，操纵重型装置、开赛车、做木匠活）中感到满足。而ISTP型的女性，也会擅长上述事物并获得相当的满足感，但实际做这些事时，会被那些传统主义者认为像野丫头。\n" +
        "\n" +
        "ISTP型往往会让人们，尤其是E型和J型的人感到不可理解。当E型和J型碰到ISTP型不可预测的行动或者看到他们对人际交往漠不关心时，往往会感觉受到冒犯，从而对他们抱怨或要求。ISTP型对这种强加于人的做法不仅强烈反对，还会故意做一些违背别人期待的行为，内心带着冷笑，因而结果上一如既往地被认为是不可理喻之人。",
    estpDetail: "ESTP型是16种性格中最善于随机应变的类型，他们看重现实而擅长观察，并能够灵活地分析和对应。\n" +
        "\n" +
        "ESTP型看重做事的价值，如果一件事不能让他们感受到价值，他们便很快着手其他的事。但对于他们认为有价值的事情，他们倾向于无视权威和既有准则，依靠自己的观察和理解衍生出一套崭新的解决方案。\n" +
        "\n" +
        "他们讨厌被说教，对于被决定好的事物很快感到厌倦，但对于各种新鲜的体验和社交活动乐此不疲。ESTP往往是社交活动的组织者亦是中心，他们用最擅长的妙语连珠和随机应变征服他人的喜爱，并主宰整个派对的气氛。\n" +
        "\n" +
        "ESTP型的典型的座右铭是“先试试看，参考书最后看就好”。\n" +
        "\n" +
        "这样的行动派为了“现在的瞬间”而活着。他们认为阅读参考书仅会把“现在的瞬间”向后推迟，所以是浪费时间。ESTP型是无法忍受与现实无关之道理的终极现实主义者。\n" +
        "\n" +
        "专门对事物注入关心（E型），以五感实际感知的东西为基础收集信息（S型），客观地分析其信息并研究（T型），同时，能够将出现的新选项灵活接受（P型）。这四个性格相结合，无论在什么情况下都能迅速地、确实地、客观地表现出行动来应对。与其什么都不做，不如做些什么好。他们相信行动的结果能启示自己明天在类似情况下做的更好。由于ESTP属于是现在就做，赊账以后再付的类型，其他类型的人常批判他们“不能沉静”或者“过于活跃”。\n" +
        "\n" +
        "的确，ESTP型被认为格外地不冷静。ESTP型如果注入了能量，就会寻求回报。如果觉得连做的价值都没有，他们就开始做下一件事。就比如，如果读到无趣的书，他们根本不会读到最后。他们反对“就算无聊的书，既然开始读了就要读完”，因为他们根本不觉得“读了总会受益”这种话，认为逼着自己读完根本就是在浪费时间。整理房间也是，如果是在找弄丢的东西还算有意义，但纯粹义务性地收拾就是浪费时间。\n" +
        "\n" +
        "因为擅长应酬，常常是社交场合的中心。他们精于随机应变地巧答，很能开玩笑，因此和他们在一起往往很开心。他们有致力于彻底解决困难工作的力量，无论什么事情都至少试着做做。他们无所畏惧，而且有旺盛的竞争心，因此常成为解决问题的角色。在全力处理有趣的课题时他们会非常可靠。但是，他们不把工作置于规则之上，工作一旦被决定好就会失去兴趣，厌倦了就想要改变环境。\n" +
        "\n" +
        "ESTP型经常忘记规定的程序和准则，这是这个类型所挥之不去的思维方式。因此，他们常会和上司发生争执。虽然也存在故意违抗权威，或者乐于去判断上司是否正当的类型，但ESTP型却并非如此，他们只是对权威毫不介意而已。\n" +
        "\n" +
        "在工作和问题前，他们往往事先不检查是否有被决定好的程序，自己简单思考一下有没有解决的办法后，就管他怎样地开始做起。其结果是，原打算做好事，但其他人无法接受，结果还被称为“麻烦制造者”。毫无恶意的ESTP型没能成为英雄，以失败告终。不过幸运的是，即使失败了，ESTP型也不太会责备自己，而是把目光转向别的事情。\n" +
        "\n" +
        "ESTP型的女性是对运动，尤其一对一的体育运动热衷的类型。如果不违背自己的性格而行动，常被那些观念陈旧的人当成假小子。他们是就算完全不行也要强行突破的性格，因此有时因为偏离了社会传统的女性刻板印象而被传统者当成怪人。\n" +
        "\n" +
        "ESTP型的生活方式很不稳定。他们总有刚刚开始着手的事情，却在此后还有更多别的事情要做，时间完全不够用。而且，他们还对这样的状况乐此不疲。运动会、暑假结束、就业、取得好成绩等等，什么事都能成为聚一下的理由。他们忙着准备这样的活动，并带头参加，虽然偶尔也会匆匆了事。\n" +
        "\n" +
        "如果自己不是中心就会浑身不自在，而他们又会对说理和“啰嗦的说明”不耐烦，因此其他类型的人会认为他们太焦躁而恼火。",
    infjDetail: "INFJ型直觉敏锐，是最擅长洞察人心的性格，因此有时也被叫做”心理咨询师”人格。\n" +
        "\n" +
        "在一群人或团队中，他们常自然而然地察觉到每个人的心理状态和人际关系，虽然他们常因为内向而将这些信息藏于心中。他们比较深邃，常对神秘或玄学抱有兴趣，停不下脑海中各种念头的涌现；但在需要表现外向时，亦能根据场面气氛而表现为让他人内心满意的姿态。\n" +
        "\n" +
        "他们往往表现为不习惯开口提出要求，不对他人吐露真实的心声，也不习惯于深度的交心，因为他们认为自己可能破坏气氛，或毁掉人际关系，并为自己破坏这种人际和谐而感到自责。因此，情感极其丰富的他们有时反而被人误认为缺乏情感，甚至有一些莫测的神秘主义感觉；然而他们不会后悔或改变，因为他们相信自己的坚持对集体和世界必有深度的价值。\n" +
        "\n" +
        "INFJ型人善良，体贴，宽容，但有点固执。\n" +
        "\n" +
        "他们直觉敏锐（N型）而性格内向（I型），头脑中常衍生出无限的想法与可能性。这种源于心的灵感和创造往往不对外展示，且其中还包含强烈的判断倾向（J型）和以人为本的追求（F型）。\n" +
        "\n" +
        "对于INFJ型人来说，在需要展露自己外向一面的场合里，开个玩笑、抖个机灵或者发表一些独创性很强的意见都不是难事。然而在这些行为的过程中，他们通常不吐露自己真实的心声，这也使得他们身边那些尝试与其交心的人们感到颇为沮丧。\n" +
        "\n" +
        "明明没有受过正规的训练，INFJ型却常能准确把握一组人或一个团队的心理动态。他们很多时候宛如拥有超能力般，敏锐地察觉到团队中的人际关系。然而，他们往往选择将察觉到的一切就这样埋藏在自己的心中。\n" +
        "\n" +
        "INFJ型善于巧妙地接纳他人的情感和爱意，但由于性格内向，他们很少自发地向他人展示自己的情感或爱意。他们常常觉得与人说话无趣而导致沟通不足，因而在职场和家庭的人际关系上产生负面影响。\n" +
        "\n" +
        "普遍上INFJ型女性比男性更吃得开。F型的她们在社会传统的刻板印象下被认为“颇具女性气质、善于照顾他人”，但由于是I型，往往这个气质并不会浮现在表面。\n" +
        "\n" +
        "在家庭和职场，她们常常倾向于不坦率地表露自己的想法。因此，她们会被身边的人，尤其是那些明确希望得到认可的人认为是缺乏情感或关心的。故INFJ的女性常常被抱怨“她是个好人，就是冷冷的”。\n" +
        "\n" +
        "当他人希望她们陪在身边时，她们会很可靠地一直陪在身边。但很多时候，她们虽然看起来或自称很冷静，内心却在不由己地发着牢骚。\n" +
        "\n" +
        "INFJ的女性吐露真心时，常常遇到这样的挫败感：即使已向对方真心实意地传达了自己的心情，也会被对方怀疑是否是有所顾虑的答复，因为她们偶尔的“吐露真心”看起来并不符合她们平日给他人展示的自己“人设”的样子。\n" +
        "\n" +
        "而相对地，INFJ的男性虽然和女性一样拥有超群的共情能力和领悟能力，但由于在社会传统印象里，他们不被认为具有足够的男性气质，而使得他们在保守的传统社会中常处于被动的立场。\n" +
        "\n" +
        "为了对抗自身软弱的形象，他们常常在一些场合相当顽固。有时，在一些细枝末节的小问题上，他们会摆出如同这件事会关系到全世界一样的态度，让周围的人难以接受。因此他们有时会背离INFJ型“用平静且富有知性的想象力来感化他人”的印象。\n" +
        "\n" +
        "INFJ型一般倾向于尝试温和地控制自我的思考，属于典型的「笔锋利于剑锋」的类型。对于INFJ型而言，家庭是可以不扭曲自身理想主义和人道主义的令人振奋的场所。\n" +
        "\n" +
        "但是，过度追求协调感的结果，偶尔也会导致人际关系的反弹。不过，比起公然引起纷争，他们更倾向于在内心解决问题。这也是F型特有的自我牺牲型解决方式。从长远的角度来看，这种做法积累的内心紧张最终会演化为他们对自身或他人抱有罪恶感的状态，却几乎无法真正解决问题。\n" +
        "\n" +
        "INFJ型的人，虽然内心极其追求协调感，但由于他们常常不开口说出该怎么做，导致很难真正达成协调。",
    enfjDetail: "ENFJ型热衷于服务他人。他们自主承担照顾他人的责任，理解群体的目标和激发他人的兴趣，是理想主义者中最热爱交际的类型。\n" +
        "\n" +
        "他们擅长直觉地把握当下状况，依赖于群体生活，有责任感，常常意识到他人的难处并用充满感染力的话语教导他人。他们乐于倾听他人抽象的理论，并以此来解决生活中的事情。\n" +
        "\n" +
        "ENFJ型擅长与他人合作，常能依靠自己强大的共情力成为团队中令人信赖的领袖。他们对他人的情感充满责任感并相信“理想的人际关系”，因此很少在公共场合批评他人，倾向于圆滑地促进周边关系的和谐。\n" +
        "\n" +
        "但与之相对，他们同样强烈希望自己被他人需要和认可，因而时常敏感地将他人的批评过于放在心上，使他们陷入深深的失落感甚至对与自己信念抵触的事实视而不见。但正是这份对他人的重视使得ENFJ型普遍热爱生活而突出于集体，从而成为很好的企业家和交际家。\n" +
        "\n" +
        "拥有强大说服力的ENFJ型人最擅长让他人对本来没有兴致的事情变得有动力。\n" +
        "\n" +
        "ENFJ型的领袖往往是能令许多人追随的非常值得信赖的领袖。他们擅长用直觉把握状况，用非常妥当而为人着想的沟通方式合理地交流。这种天生适合做领导的特质也是ENFJ型人吸引他人的理由。\n" +
        "\n" +
        "他们常能通过直觉理解一个群体寻求的目标，以及为了达成这个目标应该如何借助他人的力量。因为具备成为群体领袖的能力，ENFJ型人常常能登至组织的顶端。\n" +
        "\n" +
        "这是他们最大的长处，也是他们产生问题最多的方面。他们擅长与他人、组织一起合作行事，但相对的，若自己的想法被反对，会感到异常的挫败感。\n" +
        "\n" +
        "发生意见的冲突或遭到他人反对时，ENFJ型人会倾向于将他人批判态度视为冒犯或人身攻击，并常因此对对方怀有怨恨之心。\n" +
        "\n" +
        "即使对方仅仅试图提出一个有意义的问题，ENFJ型人却常常把单纯的见解不同逐步升级到争个谁赢谁输的程度。\n" +
        "\n" +
        "站在有力立场上的ENFJ型若以这样的方式行动，可能会导致组织的分裂。\n" +
        "\n" +
        "ENFJ型人擅长照顾和关心他人，常常被认为符合传统的女性印象，因此在传统的社会认同上女性相对占优。不过，虽然ENFJ型的女性惯于在家庭里占有话语权，但在大型组织里作为领袖时，可能会受到部分较为保守的男性下属的莫名反感。\n" +
        "\n" +
        "这是由于ENFJ的这种性格在家庭或学校都会得到相应的回报，但在社会中却常因为陈旧眼光的“女性越界”而一转遭受冷眼。\n" +
        "\n" +
        "从她们本人的角度看来，明明自己做的和学生时代没有什么变化，按照自己过去的方式做事却莫名地在社会上碰壁。\n" +
        "\n" +
        "由于ENFJ型是种“有能力的领导”型性格，而F型相比于T型又多了细腻的一面，因而ENFJ型的男性常令女性陶醉。\n" +
        "\n" +
        "无论男性还是女性，在组织中都期待着ENFJ型满满的领导力和决断力，而这种期待也很少受到辜负。\n" +
        "\n" +
        "尽管如此，由于ENFJ型人嘴巴好使又擅长讲个不停，他们往往被批评不诚实或浅薄。\n" +
        "\n" +
        "对于这样的批评，他们内心嘀咕着“怎么会呢”，而之后常常感到失落而陷入对自己的不信任感中。",
    infpDetail: "INFP型，博爱高尚，敏感细腻，在宁静而和善的外表下，他们用一颗理想主义的心推动着人类精神境界的进程。\n" +
        "\n" +
        "INFP们的内心深处往往充满了深沉强烈的感情以及坚定的伦理道德信仰，引导他们行动的是荣誉、美好、善良、理想等来自精神世界的准则。同时，他们能够敏锐地洞察世间万物的情态和变动，并陷入自己各式各样的假设和哲学思考之中，从而不断地寻求和建立一种符合内心道德标准的世界观，用它来时刻启发着自己和他们在意的人。\n" +
        "\n" +
        "虽然INFP们可能在追求内心理想的过程中过于用力，陷入对精神世界的探索无法自拔，忽视了对必要的日常琐事的经营，但正是他们充满了情感的创造力和利他主义，不断地让现实世界变得更加完美而高尚。\n" +
        "\n" +
        "一句话概括的话，这个类型是“理想主义”。\n" +
        "\n" +
        "为是IF型，主观地解释这个世界并找到一种思想，借这种理想以各种各样的形式来帮助他人。\n" +
        "\n" +
        "像“圣女贞德”一样，通过践行对社会有意义的崇高服务来追求成就感的人很多。\n" +
        "\n" +
        "INFP型有着自我负担的生活“规则”，虽然不会强加给别人，但自己会严格遵守。\n" +
        "\n" +
        "但是，在人际关系中，INFP是一种不拘小节，与人和睦相处的类型。比起掀起风波更在意和睦，只要不歪曲自己的理想，便属于与人和睦相处的一派。\n" +
        "\n" +
        "但是，一旦践踏了这一“规则”，就会变得异常盛气凌人，不仅让人吃惊，自己也会感到惊讶。作为例子，假设场景为母亲感觉自己孩子在学校被不正当处理。平时很温和的INFP型母亲会用尽一切手段，纠正学校的不正当处理方式，全力创造更好的环境——因为她觉得，让学校变好这件事，不仅仅是为了自己的孩子受益，也同时是为了其他学生着想。\n" +
        "\n" +
        "INFP的男性，在其他人，尤其是认为男性应该有男子气概的传统男性看来，被认为过于温柔，有时让人觉得带些女性气质。\n" +
        "\n" +
        "因为看起来很出色，做事却被动而随和，所以常常对于“男人的职责”摆出“交给我吧”的态度。\n" +
        "\n" +
        "但是，当感觉到自己的价值观会被威胁的时候，他会突然一变，展现出严厉的态度。\n" +
        "\n" +
        "在职场、家庭、朋友关系中，若对方不理解他的特点，会被认为有两面性，更甚者，会被认为是不知何为得体的性情不定之人。\n" +
        "\n" +
        "INFP的男性和E型的女性结婚的话，常会成为妻管严模式的家庭。但是，实际上，如果不尽早发觉被妻子掌握主导权应有限度，婚后生活可能不会很顺利。\n" +
        "\n" +
        "在社会生活中，INFP的女性被认为性格很好，常常也会令人钦佩。\n" +
        "\n" +
        "在陈旧的社会眼光中，“老实却又顽固”这个特征，在男性的情况下，认为虽性格上不强加于人却不懂通融，但在女性的情况下，会被认为内心强大而受到称赞。\n" +
        "\n" +
        "INFP型为了不被人贴上标签，常常做一些被人认为“这人明明不是这样”的行动。而这时常以无法预测的唐突的行动而展现。",
    enfpDetail: "ENFP型是天真烂漫的梦想家，他们用满溢激情的心灵为世界增添不拘一格的亮色。\n" +
        "\n" +
        "在ENFP的眼中，世界由无数的可能性组成，而且其中总有很多可能性让人热血沸腾。ENFP型人十分随性，常常会突如其来地想到一些点子，然后立即去尝试，投以充足的热情和行动力并乐在其中。ENFP是天生的乐观主义者，他们常常像孩子一样不顾客观的风险和他人的眼光，一往无前地追逐内心的梦想。\n" +
        "\n" +
        "因此，追求稳定的传统人群和社会可能认为ENFP过于幼稚、没有根基，但ENFP却总会一笑而过。ENFP是一群永葆童心的可爱孩子。\n" +
        "\n" +
        "ENFP型活跃、热心、非常善于与人交往、积极并具有社交性。\n" +
        "\n" +
        "E型、N型、F型、P型相互作用，常能发挥同时出色解决各种问题和课题的能力。\n" +
        "\n" +
        "因为满怀热情地积极生活，当他们带着令人兴奋的思想而扬起改变现状的大旗，常能聚集应援而来的人们为一个强大的集体。可惜的是，和ENTP型类似，他们擅长开始，却常不能坚持做到最后。因而，虽然拥有领导者魅力的ENFP打动和聚集了人们，他们却常因为其本人缺乏组织力和持久的执行力而产生挫败感。\n" +
        "\n" +
        "ENFP型性格大多和和气气、让人高兴、凭直觉行事、在意他人，刻板印象上比起男性更倾向于女性的性格。因此，ENFP型男性按照本性行事的话，常常会做出超出传统印象中社会要求的行为。讽刺的是，为了弥补这一点，他们反而常试图采取不像ENFP型的行动，比如变得十分较劲，或过分地死抠道理。明明不是很喜欢，却让自己投入到那些单挑的体育运动或“困难”的活动。\n" +
        "\n" +
        "ENFP型讨厌把人归类或套在条条框框里，自己也非常讨厌被塞进条条框框。他们很喜欢自己多面的性格。他们稍微有点兴趣就能“与人合得来”，可以和对方的想法和感情产生共鸣，但不小心地话可能会失去自我。他们不难接受他人个性和问题的优秀的资质，常被人认为值得信赖和善于理解。但这也导致他们常常忘掉自己是谁，不知道到底该做什么而变得迷茫。\n" +
        "\n" +
        "ENFP型不擅长放松自我。他们会突然想到什么点子而乘兴，从而忘却时间观念和疲劳。直到最终疲倦为止保持高度热衷。因此，他们时常会牺牲自己的身体状态，得不到充分的休息。",
    intjDetail: "INTJ型是掌控全局、特立独行的战略家，他们用深刻的洞见、高远的大局观和卓越的执行力引领潮流，改变世界。\n" +
        "\n" +
        "在INTJ的眼中，他们的直觉总会指向正确的方向和未来的趋势，而只要是这种直觉所断定有意义的事情，他们就一定会坚持做下去并做到完美。即使信息不足或不被理解，他们也愿意坚持道路并努力践行，因此会给人一种“虽千万人吾往矣”的冷峻决绝感。\n" +
        "\n" +
        "在旁人眼中，这或许是过度自信、不近人情、强硬偏执的表现，但他们最终却常常可以向世人和自己的内心证明：“我，总是对的。\n" +
        "\n" +
        "I（内向）N（直觉）型的他们在各种事情上都能想到无数的可能性，将这个特点与T（思考）J（决断）型的一面联系起来，就组合成INTJ型人“什么都想改善”的性格了。INTJ型人经常突然间“想到更好的主意”。语言、计划、构想、构思甚至连人本身都包括在内，他们认为什么都有改善的余地。在INTJ型人的眼中，即使是最好的东西也能得到改善。\n" +
        "\n" +
        "他们常常会有这样的体验：本是去参加一个组织，回过神来便已成为组织中的头号人物。这是因为他们一方面大局观很强、且常常可以理解事物最错综复杂的部分（N型）、另一方面又是一旦开始做就要做到底的类型（J型），因而目标达成率往往很高。INTJ型人常被认为善于完成工作，话语精准而适当，也不错过任何机会。\n" +
        "\n" +
        "十六种类型中，INTJ是极度的特立独行型。与其他NT型人相似地，这一特立独行的做法往往被人认为是傲慢的表现，因而难以与人发展到很深的交往。无论是工作还是玩耍，他们常被别人认为喜欢居于高处、穷根究理。然而从他们的角度来看，自己本无他意，只是就事论事。因此，被人认为孤高或受到无法令人安心的非难时，他们往往会毫不自知地感到惊讶。\n" +
        "\n" +
        "NT型本是通过讨论而加深理解的类型，但由于他们的这种特性，常常会有以下情形发生：本人认为在“友好地交谈”，他人却将其视为敌对心满满的令人讨厌的家伙。\n" +
        "\n" +
        "INTJ的男性比例多于女性。有时，独立心强烈而善于诡辩的INTJ女性会被那些传统主义者们认为缺乏传统意义上的女性气质。但大部分INTJ女性仍保持自我，因为她们并不在乎这些目光。",
    entjDetail: "ENTJ型，志存高远、胸怀天下，是天生的领袖型性格，他们用卓绝的执行力、决断力，和对未来大趋势的深远洞察，掌控通往伟岸目标的道路。\n" +
        "\n" +
        "在ENTJ眼中，一旦笃定要征服一方疆土（无论具体还是抽象），他们就会在脑海中构建出如棋局般的复杂计划，巧妙地调动资源，有条不紊地达成目标，途中一往无前，不由分说。他们与生俱来就享受这种号令天下莫敢不从的掌控感，在任何组织都会努力寻求领导地位，因此有时被认为不近人情甚至不择手段。\n" +
        "\n" +
        "然而，他们的霸气和大局观，以及独具一格的行事方式，常常能够让他们完成他人不能做到、甚至不能想到的伟业，从而引领历史和时代的潮流。\n" +
        "\n" +
        "精神强健，能言善论，意志坚强，这三个词正确地表达了ENTJ型的特征。\n" +
        "\n" +
        "这几个特征组合起来的性格有非常强的支配欲，常发挥非凡的领导能力。对于ENTJ，这个世界宛若棋盘，因此他们常为了大局思考自己该如何移动棋盘上的棋子。\n" +
        "\n" +
        "他们认为任何问题都在互相交流和意见的唇枪舌战中变得清晰可解。在这种情况下，ENTJ往往首先以自己为正确为前提，若别人想说服自己是错误的，必须通过辩论来证明。但是，若没有抱有积极性与自己的意见相对抗的人，这个“证明”的过程会变得不太顺利。议论结束后，若ENTJ型的意见最终是正确的，他们会认为靠这样的唇枪舌战果然可以使大家比原先变得更好。若ENTJ型是错误的，他们会称赞坚定地持有反对意见的论述者，或对他们表示敬意，并感谢因此受教。\n" +
        "\n" +
        "ENTJ型比其他的任何类型都不够忍耐。这表现在，火气大，对于些小问题找茬，觉得无聊时立刻会将兴趣转移到其他事情上。因为极其自我中心，所以哪怕面对纠缠不清的人际关系问题，他们仍觉得自己什么都能做得到，什么都能处理得了，实际上自己本不擅长处理这些问题。因此，当他们对于人际关系处理失败时，会缠上压力、变得烦恼和无精打采，比起问题本身，陷入自我责备和自我批判中。\n" +
        "\n" +
        "无论自我批判还是对他人批判，ENTJ都很能发挥本领：言语尖锐、毫不留情、严厉抨击。他们尤其擅长说话技巧，说话方式十分清晰、清楚地表达自己的观点，是交流的大师。\n" +
        "\n" +
        "由于ENTJ是与傲慢对抗的充满支配欲的类型，一些ENTJ女性常常被观念很传统的人认为完全不像女性的风格。她们做自己，做的非常优秀，但有时会在陈旧的环境中喘不过气来。若长辈试图将符合女性刻板印象的特质强行灌输给她们，她们大多会反抗。一些其他女性会因为ENTJ型女性的傲慢而感到恼火，感到自己仿佛“被看扁了”。因此，她们不知不觉地就被孤立了。\n" +
        "\n" +
        "当对方是男性的时候更不用说，这个问题变得更加严重。提出严格的要求、客观、有才能而自立的性格尤其不容易让“大男子主义者”感到喜爱。由于外显这种气场，即使本是相当爱照顾和担心他人的类型，也常不被人所知。\n" +
        "\n" +
        "ENTJ型常常明明没生气，却被说“看上去十分生气”。他们对此感到诧异，因为他们本人只是热心。因此，当他们知道自己被他人这样想，会产生很大烦恼（他们身边的人也很烦恼）而陷入不得不用看起来如同发怒的说话方式来辩明自己并没有生气的颇为讽刺的局面。带着这种态度，无论怎么做都是徒然的。变成这种局面时，他们要么越发地施展自己的热辩（为证明自己没生气），要么变得失去干劲，转移到其他问题上。然而无论怎么做，被牵扯在内的人们都会疲惫地结束这个话题。\n" +
        "\n" +
        "因为有着天生的指导力和企划力，ENTJ型人出人头地很快。在前行途中，虽然有同伴或朋友变得疏远，但他们会认为那是为了发挥自己的能力、证明自我所不得不付出的代价。并且，他们会认为若目标达成，自己和其他人都在此中学习成长的话，这种疏远也不算白费。\n" +
        "\n" +
        "他们常常这样地客观分析人际关系中的两难之处，因此，当他们发现由于自己的独断（F人尤其认为这是绝情的表现）而导致有人受伤、感到挫折或畏缩时，会十分难以理解。他们认为议论和竞争可以让人们成长和向上，因而不能理解人们为什么会把这种针锋相对当做对自己的不尊重甚至讥讽。",
    intpDetail: "INTP型，沉默自主，洞察力强，他们用脑海中的奇思妙想在不断拓宽人类的理论版图。\n" +
        "\n" +
        "在INTP看来，个人的自主性和思考的独立性十分重要，对抽象概念、思维结构、理论知识等的探究总能激起他们无穷的兴趣。INTP们擅长发掘各类事物之间的联系，经常从不同角度畅想各种可能性，也习惯于从书本，论文和数据中寻找知识和灵感，还能很好地将各类概念和想法组织起来。他们用这些方法收集和处理信息，用以建立起自己的一套逻辑体系。\n" +
        "\n" +
        "虽然INTP有时候会被认为过于冷静，像个旁观者，对细节缺乏足够的耐心，但正是这种理性而体系化的视野，结合他们开阔的思维方式，为我们带来更多富有创见又合乎逻辑的方法论。\n" +
        "\n" +
        "INTP属于画面感极强的、看起来心不在焉地沉浸于自己思考中的大学教授的类型。\n" +
        "\n" +
        "他们擅长在头脑中独自慢慢地思考（I型），而N型的想象力使得他们的大脑中可以散发出各种各样的可能性。因为客观（T型）而随机应变（P型），他们对于任何新事物都能很快接受。在论文、图纸、计划、企划、提案、理论等方面，他们会将零散的信息总结成一个完整的版图，但由于不断发现新的数据，其完成图的尺寸变得越来越大。\n" +
        "\n" +
        "结果上，对于思考、构想或是计划，无论其看起来如何完美无缺，一旦他们入手了新的数据便又开始进行一顿修改。这对于INTP型人来说是令自己兴奋而开心的行为，但对于其他的人，尤其是对于J型寻求决断的人来说却使他们反感，因为这种迟于定稿的风格让他们产生挫败感。\n" +
        "\n" +
        "INTP常常热衷于寻找看似完美之物的瑕疵，并试图提出更好的建议，因此有时在旁人看来他们是吹毛求疵的批评家。他们完美、有能力、优秀，但若极端，则会反而变成负担，变得厌烦和自责。\n" +
        "\n" +
        "虽然当代社会在逐渐趋于平等，但在较为传统的环境下，INTP的女性仍可能会在行事中遇到麻烦。陷入沉思的大学教授，传统上往往相比于女性形象更像男性形象，因此用头脑来强词夺理的资质，在社会陈旧的眼光中，往往男性的场合被宽恕，但女性的场合则往往不被接受。\n" +
        "\n" +
        "这造成对于INTP型女性的一些偏见。\n" +
        "\n" +
        "第一，遗留的传统眼光中，在家庭事务外，女性较少被认为有强大的制定计划能力。因此，对于INTP型来说理所当然的“想要按照自己头脑中思考的道理来演绎人生”的心理需求，与中国传统社会中所期待的女性职责相反。\n" +
        "\n" +
        "第二，独创性思考也不被认为符合刻板的女性印象。比如，如果被问“请问时间是？”，INTP型会想描述时间的哲学意义。试想聚会上坐着一群人，若某位男性表现出这样的古怪一面，多半被众人认为脑子聪明过头了；但同样的事情发生在女性上，却常被贴上“迟钝”，“不识场合”，甚至“奇葩”的标签。\n" +
        "\n" +
        "第三，T型有悖于传统意义上顺从、温柔、关怀等女性刻板印象。INTP型女性在其自身心理状况较差的情况下表现出感情的时候，这种情感往往令大多数S型人难以理解而显得有些突兀，常令其本人和他人都觉得吓一跳。",
    entpDetail: "ENTP型永远不停止开拓创新的脚步，他们用创意十足而又逻辑严密的脑洞引领未来。\n" +
        "\n" +
        "在ENTP的眼中，世界是由无数有趣的可能性组成的，只要逻辑上成立，一切皆为合理，一切皆有可能。 ENTP热衷于打破传统和定势，拓展思维的广度，并且尝试各种新鲜的事物，因此他们兴趣广泛、特长众多，是真真正正的多面手和通才。\n" +
        "\n" +
        "然而，在长幼有序、寻求安稳、各司其职的传统社会里面，ENTP由于过度活跃的头脑和对权威、传统的不屑一顾，以及较差的持续性，有时会被当作不正经、不安分的顽童来看待。ENTP是一群“长不大”的天才。\n" +
        "\n" +
        "ENTP型人富有创意，无论是做本职工作还是投身业余爱好，都会积极地参与在其中。\n" +
        "\n" +
        "作为N型，他们善于发掘无限的可能性。配合客观果断（T型）和外向（E型），他们时常提出新的构想甚至梦想。\n" +
        "\n" +
        "ENTP型和大多数EP型类似，比起把某个已存在的想法付诸实现，常常更加享受追求新的想法。世界在他们眼中宛如棋盘，而包括他们在内的人们则好比棋盘上的棋子。他们会觉得，既然是棋子，就理所应当地应该朝着更好的方向行动吧？\n" +
        "\n" +
        "于是到头来，他们把自己和他人都卷入到各种各样的尝试中，在生活中接二连三地挑战新事物。当然，他们或许会在无止境的追逐梦想的过程中半途而废。\n" +
        "\n" +
        "在家庭、职场或是兴趣上，他们无论做的多么好，都常认为明明可以做的更好。另外，因为他们是豪赌行事的类型，如果事情顺利的话会成为亿万富翁，但失败时则会变得身无分文。因此，ENTP型的人生使得其本人和周围的人充满了持续不断的无法预测的起伏和急转弯，如同充满惊险的过山车。\n" +
        "\n" +
        "一般来说，T型的女性在社会上有着逆流而上的倾向，她们能够发挥出超出常人的天赋和魅力。不过若ENTP型处在传统的环境里，可能会有一些麻烦。她们客观的样子、随机应变的好头脑和竞争心、喜好议论的表现，会被那些传统主义的男性敬而远之。尤其，她们应对传统体系或者人物时，常会掂量掂量对方到底几斤几两。女性这样试探他人和挑起竞争的个性使这些传统主义者感到厌烦。但有趣的是，ENTP型男性在相同的情况下，相同的个性却有时被当做是加分点。\n" +
        "\n" +
        "不过，在传统的社会中会让其他类型的人感到厌烦这一点上，ENTP的男性往往也半斤八两。",
}